Revit 2026 API

# SpatialElementTagHasElbow Property

---

Identifies if the tag's leader has an elbow point or not.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool HasElbow { get; }
```
```vb
Public ReadOnly Property HasElbow As Boolean
	Get
```
```cpp
public:
property bool HasElbow {
	bool get ();
}
```
```fsharp
member HasElbow : bool with get
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no leader for this tag. |

Straight leaders do not have elbow points. Use LeaderElbow to get or set elbow point.

#### Reference

SpatialElementTag Class

Autodesk.Revit.DB Namespace